hybridMultiphaseFoamV7/tutorials/FreeFlowCases/CapillaryRiseInTube/standardBoundary/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 0
    volScalarFieldValue eps 1
);

regions
(
    boxToCell
    {
        box (0 0 -1) (1 8e-3 1);

        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }

    boxToCell
    {
        box (0 0 -1) (2e-5 1 1);

        fieldValues
        (
//            volScalarFieldValue eps 0.5
        );
    }

 boxToCell
    {
        box (9.8e-4 0 -1) (1 1 1);

        fieldValues
        (
  //          volScalarFieldValue eps 0.5
        );
    }


);


// ************************************************************************* //
